{{- if eq .chezmoi.os "darwin" -}}
tap "common-fate/granted"
tap "remotemobprogramming/brew"

brew "adr-tools"
brew "awscli"
brew "bat"
brew "btop"
brew "chezmoi"
brew "deno"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "go"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "gpg2"
brew "gping"
brew "common-fate/granted/granted"
brew "mise"
brew "ni"
brew "imagemagick"
brew "jq"
brew "jsonpp"
brew "neovim"
brew "pinentry-mac"
brew "poppler"
brew "resvg"
brew "ripgrep"
brew "sevenzip"
brew "shellcheck"
brew "starship"
brew "tmux"
brew "trash"
brew "uv"
brew "watch"
brew "worktrunk"
brew "yazi"
brew "zoxide"
brew "zsh-syntax-highlighting"

{{ if eq .isWorkComputer true -}}
brew "remotemobprogramming/brew/mob"
{{ end -}}

# Cask - Apps
cask "blender"
cask "claude"
cask "claude-code"
cask "cleanshot"
cask "comet"
cask "cyberduck"
cask "ghostty"
cask "glide"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "logi-options+"
cask "obsidian"
cask "opencode-desktop"
cask "orbstack"
cask "postman"
cask "raycast"
cask "remnote"
# cask "runjs"
cask "spotify"
cask "stats"
cask "visual-studio-code"

# Cask - Apps - Personal Computer
{{ if eq .isPersonalComputer true -}}
cask "cryptomator"
# cask "exifcleaner"
cask "jellyfin-media-player"
cask "microsoft-teams"
cask "protonvpn"
cask "proton-pass"
cask "spotify"
cask "steam"
cask "transmission"
cask "vlc"
{{ end -}}

# Cask - Apps - Work Computer
{{ if eq .isWorkComputer true -}}
# https://github.com/fougue/mayo/wiki/Build-instructions-for-macOS
brew "cmake"
brew "qt@5"
brew "opencascade"
brew "assimp"

cask "session-manager-plugin"
cask "slack"
cask "miro"
{{ end -}}

# Cask - Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"

{{- end -}}
