{{- if eq .chezmoi.os "darwin" -}}
tap "homebrew/bundle"
tap "common-fate/granted"

brew "awscli"
brew "btop"
brew "chezmoi"
brew "docker"
brew "docker-compose"
brew "eza"
brew "fzf"
brew "gh"
brew "go"
brew "git"
brew "gnupg"
brew "gping"
brew "granted"
brew "jq"
brew "jsonpp"
brew "shellcheck"
brew "starship"
brew "tmux"
brew "trash"
brew "watch"
brew "zsh-syntax-highlighting"

{{- if eq .isWorkComputer true }}
brew "libpq"
brew "postgresql@16"
{{ end }}

# Cask - Apps
cask "cleanshot"
cask "firefox"
cask "firefox@developer-edition"
cask "ghostty"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "logi-options+"
cask "obsidian"
cask "ollama"
cask "postman"
cask "raycast"
cask "rectangle"
cask "remnote"
cask "runjs"
cask "spotify"
cask "visual-studio-code"
cask "zen-browser"

# Cask - Apps - Personal Computer
{{ if eq .isPersonalComputer true }}
# cask "exifcleaner"
cask "httpie"
cask "protonvpn"
cask "proton-pass"
cask "steam"
cask "transmission"
cask "vlc"
{{ end }}

# Cask - Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"

vscode "andys8.jest-snippets"
vscode "CoenraadS.disableligatures"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "naumovs.color-highlight"
vscode "supermaven.supermaven"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "yzhang.markdown-all-in-one"

{{- if eq .isWorkComputer true }}
vscode "CircleCI.circleci"
vscode "firsttris.vscode-jest-runner"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.vscode-xml"
{{ end }}

{{- end -}}
