{{- if eq .chezmoi.os "darwin" -}}
tap "homebrew/bundle"
tap "common-fate/granted"
tap "remotemobprogramming/brew"

brew "adr-tools"
brew "awscli"
brew "bat"
brew "btop"
brew "chezmoi"
brew "deno"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "go"
brew "git"
brew "git-delta"
brew "gnupg"
brew "gpg2"
brew "gping"
brew "granted"
brew "imagemagick"
brew "jq"
brew "jsonpp"
brew "neovim"
brew "pinentry-mac"
brew "poppler"
brew "resvg"
brew "ripgrep"
brew "sevenzip"
brew "shellcheck"
brew "starship"
brew "tmux"
brew "trash"
brew "uv"
brew "watch"
brew "yazi"
brew "zoxide"
brew "zsh-syntax-highlighting"

{{ if eq .isWorkComputer true -}}
brew "graphviz"
brew "libpq"
brew "postgresql@16"
brew "remotemobprogramming/brew/mob"
{{ end -}}

# Cask - Apps
cask "claude"
cask "cleanshot"
cask "cyberduck"
cask "ghostty"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "logi-options+"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "remnote"
cask "runjs"
cask "spotify"
cask "stats"
cask "visual-studio-code"

# Cask - Apps - Personal Computer
{{ if eq .isPersonalComputer true -}}
cask "cryptomator"
# cask "exifcleaner"
cask "jellyfin-media-player"
cask "protonvpn"
cask "proton-pass"
cask "spotify"
cask "steam"
cask "transmission"
cask "vlc"
{{ end -}}

# Cask - Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"

vscode "andys8.jest-snippets"
vscode "anthropic.claude-code"
vscode "asyncapi.asyncapi-preview"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "CoenraadS.disableligatures"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "naumovs.color-highlight"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vitest.explorer"
vscode "yzhang.markdown-all-in-one"

{{ if eq .isWorkComputer true -}}
vscode "CircleCI.circleci"
vscode "firsttris.vscode-jest-runner"
vscode "ms-vsliveshare.vsliveshare"
vscode "Prisma.prisma"
{{ end -}}

{{- end -}}
